# minisql
Есть 6 модей: add, read, get, update.

Add - добавить значения в БД
Read - прочитать всю таблицу
Get - узнать какое-то значение из таблицы
Edit - изменить значения в таблице

### Начало работы
В начале нам надо задать таблицу и базу данных:
```
import minisql
baza = "testmodule", "test1"
```

### Add
```
minisql.add(baza, ("id", "text"), (1, "user"))
```
Работает это так:
(база, ряд, информация)
### Read
```
minisql.read(baza)
```
Возвращает всю инфу с базы. Можно пройтись циклом. Пример того, что возвращает:
`[(1, 'user'), (456, 'margaryt'), (1245, 'test')]`
### Get
```
minisql.get(baza, "text", "id", 1)
```
Работает это так:
(база, ячейка данные из которой хотим достать, ключ, чему равен ключ)
Возвращает, в моем случае, user.

### Edit
```
a = minisql.edit(baza, "text", "roshen", "id", 1)
```
Работает это так:
(база, что хотим поменять, на что хотим поменять, ключ, чему равен ключ)
Возвращает True, если удалось провернуть операцию.

### Iget
```
minisql.iget(baza, "count", "userid", 12345, "chatid", -100423947)
```
Можно получить значение, при 2 условиях. В моем случае если айди чата -100423947, а айди юзера 12345. Принцип работы как у get.

### Iedit
```
minisql.iedit(baza, "count", 16, "userid", 12345, "chatid", -100423947)
```
Было 6, стало 16. Опять же, работает как и edit. 

**Различные примеры вы можете найти в папке examples.**
